tests/pyreverse/functional/class_diagrams/relationships/fields.mmd
classDiagram
  class Aggregation1 {
    x
  }
  class Aggregation2 {
    x
  }
  class Association {
    x
  }
  class Composition1 {
    x
  }
  class Composition2 {
    x
  }
  class P {
  }
  P <-- Association : x
  P --* Composition1 : x
  P --* Composition2 : x
  P --o Aggregation1 : x
  P --o Aggregation2 : x
